{
  "products": [
    {
      "id": "magnesium-bisglycinate",
      "name": "Magnesium Bisglycinate",
      "slug": "magnesium-bisglycinate",
      "description": "Highly absorbable magnesium chelate to support deep sleep, relaxation, and muscle recovery.",
      "price": 29,
      "image": "/images/magnesium.svg",
      "category": "Mineral",
      "highlights": [
        "Chelated for superior absorption",
        "Promotes calm and sleep quality",
        "Supports nerve and muscle function"
      ]
    },
    {
      "id": "psyllium-fiber",
      "name": "Organic Psyllium Fiber",
      "slug": "organic-psyllium-fiber",
      "description": "Gentle prebiotic fiber to balance digestion, blood sugar, and satiety without bloating.",
      "price": 24,
      "image": "/images/fiber.svg",
      "category": "Fiber",
      "highlights": [
        "Promotes regularity",
        "Supports microbiome diversity",
        "Helps manage cravings"
      ]
    }
  ],
  "posts": [
    {
      "id": "1",
      "title": "Magnesium Bisglycinate Benefits for Sleep, Stress, and Recovery",
      "slug": "magnesium-bisglycinate-benefits",
      "excerpt": "Learn how highly absorbable magnesium bisglycinate calms your nervous system, supports deep sleep, and eases muscle tension.",
      "content": "Magnesium bisglycinate pairs elemental magnesium with the amino acid glycine, creating a chelated form that the gut can absorb efficiently without the laxative effect common in oxide or citrate. Research shows that adequate magnesium intake helps regulate the parasympathetic nervous system, which in turn improves sleep latency and reduces restless legs. For athletes, magnesium accelerates muscle relaxation after intense training and keeps energy production humming by acting as a cofactor in ATP synthesis. \\n\\nTo get the most from magnesium bisglycinate, take it in the evening with a light snack that includes protein—the glycine may also support deeper slow-wave sleep. Consistency matters; stacking it with sun exposure early in the day, a high-quality electrolyte routine, and evening blue-light hygiene creates a holistic sleep hygiene protocol that searchers for “magnesium for sleep” and “magnesium for anxiety” are actively seeking. Always check labels for third-party testing and choose doses between 200-400 mg of elemental magnesium based on your healthcare provider’s guidance.",
      "image": "/images/magnesium.svg",
      "date": "2025-01-12",
      "author": "Orbucell Team",
      "tags": ["magnesium", "sleep", "stress relief"]
    },
    {
      "id": "2",
      "title": "Psyllium Fiber for Gut Health, Blood Sugar Balance, and Weight Loss",
      "slug": "psyllium-fiber-benefits",
      "excerpt": "Discover why psyllium husk is the go-to soluble fiber for better digestion, cholesterol support, and long-lasting fullness.",
      "content": "If you are researching “psyllium fiber benefits” or comparing “psyllium vs chia,” start with its soluble fiber content. Psyllium forms a gel with water and feeds beneficial gut bacteria, increasing short-chain fatty acid production that heals the intestinal lining. That gel also slows glucose absorption, making psyllium husk a smart add-on for those managing fasting glucose or A1C levels. Clinical studies link eight grams of psyllium twice daily with modest LDL cholesterol reductions, which is why cardiologists often pair it with lifestyle coaching. \\n\\nFor weight management, blend one scoop of organic psyllium fiber into a smoothie 30 minutes before a meal. The increased satiety cues help prevent overeating while keeping digestion regular—a common search intent around “fiber for bloating” and “natural appetite control.” Always follow your serving with at least 12-16 ounces of water and introduce fiber gradually to avoid discomfort.",
      "image": "/images/fiber.svg",
      "date": "2025-01-26",
      "author": "Orbucell Team",
      "tags": ["fiber", "gut health", "weight management"]
    },
    {
      "id": "3",
      "title": "Morning Wellness Routine: Pair Magnesium and Fiber for All-Day Energy",
      "slug": "magnesium-and-fiber-routine",
      "excerpt": "Build a simple morning stack that stabilizes energy, digestion, and mood by combining magnesium bisglycinate with psyllium fiber.",
      "content": "The most searched morning rituals—think “wellness morning routine” and “healthy gut routine”—share the same pillars: mineral balance, digestive support, and mindful movement. Start with a tall glass of mineralized water, adding a scoop of psyllium fiber to support gentle detox and kick-start peristalsis. Wait 20 minutes, then enjoy a protein-forward breakfast to anchor blood sugar. \\n\\nAfter breakfast, take magnesium bisglycinate alongside vitamin D or omega-3s. This timing supports calm focus without the drowsiness that can come from taking magnesium mid-day. Layer in five minutes of breathing or sunlight to reinforce circadian rhythm. Customers who follow this stack report fewer energy crashes, more regular digestion, and better recovery from training sessions.",
      "image": "/images/wellness-stack.svg",
      "date": "2025-02-02",
      "author": "Orbucell Team",
      "tags": ["morning routine", "energy", "longevity"]
    }
  ],
  "customers": [
    {
      "id": "cust-101",
      "name": "Jordan Miles",
      "email": "jordan@example.com",
      "status": "Active",
      "orders": 3,
      "lifetimeValue": 197
    },
    {
      "id": "cust-102",
      "name": "Priya Shah",
      "email": "priya@example.com",
      "status": "VIP",
      "orders": 8,
      "lifetimeValue": 612
    },
    {
      "id": "cust-103",
      "name": "Leo Kim",
      "email": "leo@example.com",
      "status": "Lead",
      "orders": 0,
      "lifetimeValue": 0
    }
  ]
}
